**ABIYYU FATHIN DERIAN**

**IYKRA DATA FELLOWSHIP BATCH 6**

# PYTHON PRACTICE CASE

## NUMBER 1

## Import Required Library

In [1]:
import sqlite3 as sql
import pandas as pd
import json

## Connect to SQLite

In [2]:
con = sql.connect('answer1.db')
cur = con.cursor()

## Drop Existing Table

In [3]:
cur.execute('DROP TABLE transactions')

## Create Table in Database

In [4]:
cur.execute('''CREATE TABLE transactions (
    id INT(3),
    insert_time TIMESTAMP, 
    tx_amount FLOAT, 
    tx_type TEXT(20), 
    status TEXT(20))''') 
con.commit()

## Insert Rows in The Table

In [5]:
cur.execute('''INSERT INTO transactions (
    id, 
    insert_time, 
    tx_amount, 
    tx_type, 
    status
    ) 
VALUES 
    (1, "2021-07-01 13:02:34", 23, "buy", "open"),
    (1, "2021-07-01 13:20:14", 23, "buy", "close"),
    (2, "2021-07-01 13:46:52", 98, "sell", "open"),
    (3, "2021-07-01 13:59:12", 51, "sell", "open"),
    (4, "2021-07-01 14:06:48", 47, "buy", "open"),
    (3, "2021-07-01 14:18:36", 51, "sell", "close"),
    (5, "2021-07-01 14:34:22", 11, "sell", "open"),
    (5, "2021-07-01 14:50:11", 11, "sell", "close"),
    (4, "2021-07-01 14:58:41", 47, "sell", "close"),
    (6, "2021-07-01 15:00:00", 72, "buy", "open"),
    (7, "2021-07-01 15:12:12", 91, "sell", "open");''')
con.commit()

## Get The Last Transaction of Each Id

In [22]:
syntax = cur.execute('''
        SELECT *
        FROM transactions
        GROUP BY Id
        HAVING MAX(insert_time)
''')
con.commit()

row = syntax.fetchall()
col = syntax.description
result = pd.DataFrame(row, columns = col)
result

   id          insert_time tx_amount tx_type status
  NaN                  NaN       NaN     NaN    NaN
  NaN                  NaN       NaN     NaN    NaN
  NaN                  NaN       NaN     NaN    NaN
  NaN                  NaN       NaN     NaN    NaN
  NaN                  NaN       NaN     NaN    NaN
  NaN                  NaN       NaN     NaN    NaN
0   1  2021-07-01 13:20:14      23.0     buy  close
1   2  2021-07-01 13:46:52      98.0    sell   open
2   3  2021-07-01 14:18:36      51.0    sell  close
3   4  2021-07-01 14:58:41      47.0    sell  close
4   5  2021-07-01 14:50:11      11.0    sell  close
5   6  2021-07-01 15:00:00      72.0     buy   open
6   7  2021-07-01 15:12:12      91.0    sell   open

-----------------

## NUMBER 2

## Connect to SQLite

In [23]:
con2 = sql.connect('answer2.db')
cur2 = con2.cursor()

## Drop Existing Table

In [24]:
cur2.execute('DROP TABLE sales')

## Create Table in Database

In [25]:
cur2.execute('''CREATE TABLE sales (
    Date DATE, 
    Sales FLOAT)''') 
con2.commit()

## Insert Rows in The Table

In [26]:
cur2.execute('''INSERT INTO sales (
    Date, 
    Sales
    ) 
VALUES 
    ("2021-01-01", 100),
    ("2021-01-02", 34),
    ("2021-01-02", 123),
    ("2021-01-02", 134),
    ("2021-01-03", 145),
    ("2021-01-03", 24),
    ("2021-01-04", 541),
    ("2021-01-04", 636),
    ("2021-01-05", 322),
    ("2021-01-06", 242),
    ("2021-01-07", 22),
    ("2021-01-08", 46);''')
con2.commit()

## Get The Sum of Sales in Each Date

In [27]:
syntax2 = cur2.execute('''
    SELECT Date, SUM(Sales) total_of_sales
    FROM sales
    GROUP BY Date
    HAVING SUM(Sales)
''')
con2.commit()

row2 = syntax2.fetchall()
col2 = syntax2.description
result2 = pd.DataFrame(row2, columns = col2)
result2

         Date total_of_sales
          NaN            NaN
          NaN            NaN
          NaN            NaN
          NaN            NaN
          NaN            NaN
          NaN            NaN
0  2021-01-01          100.0
1  2021-01-02          291.0
2  2021-01-03          169.0
3  2021-01-04         1177.0
4  2021-01-05          322.0
5  2021-01-06          242.0
6  2021-01-07           22.0
7  2021-01-08           46.0

-----------------

## NUMBER 3

## Define The Dataset

In [28]:
dataset = [
   {
       "user": {
           "id": 1,
           "name": "agus",
           "email": "agus@example.com"
       },
       "txs": [
           {
               "id": 1,
               "tx_date": "2020-01-01",
               "tx_amount": 10,
               "tx_type": "buy"
           },
           {
               "id": 3,
               "tx_date": "2020-02-01",
               "tx_amount": 10,
               "tx_type": "buy"
           },
           {
               "id": 5,
               "tx_date": "2020-03-01",
               "tx_amount": 20,
               "tx_type": "sell"
           }
       ]
   },
   {
       "user": {
           "id": 2,
           "name": "asep",
           "email": "asep@example.com"
       },
       "txs": [
           {
               "id": 2,
               "tx_date": "2020-01-01",
               "tx_amount": 10,
               "tx_type": "sell"
           },
           {
               "id": 4,
               "tx_date": "2020-02-01",
               "tx_amount": 10,
               "tx_type": "sell"
           },
           {
               "id": 6,
               "tx_date": "2020-03-01",
               "tx_amount": 20,
               "tx_type": "buy"
           }
       ]
   }
]

## Check The json as DataFrame

In [29]:
pd.DataFrame(dataset)

,user,txs
0,"{'id': 1, 'name': 'agus', 'email': 'agus@examp...","[{'id': 1, 'tx_date': '2020-01-01', 'tx_amount..."
1,"{'id': 2, 'name': 'asep', 'email': 'asep@examp...","[{'id': 2, 'tx_date': '2020-01-01', 'tx_amount..."

## Create CSV_1

In [30]:
user_id = []
tx_id = []

for i in dataset:
    for j in i['txs']:
        user_id.append(i['user']['id'])
        tx_id.append(j['id'])
print(user_id, tx_id)

table_1 = pd.DataFrame(list(zip(user_id, tx_id)), columns =['user_id', 'tx_id'])

table_1.to_csv('CSV_1.csv')

[1, 1, 1, 2, 2, 2] [1, 3, 5, 2, 4, 6]

## Create CSV_2

In [31]:
Id = []
name = []
email = []

for i in dataset:
    Id.append(i['user']['id'])
    name.append(i['user']['name'])
    email.append(i['user']['email'])
print(user_id, name, email)

table_2 = pd.DataFrame(list(zip(Id, name, email)), columns =['Id', 'name', 'email'])

table_2.to_csv('CSV_2.csv')

[1, 1, 1, 2, 2, 2] ['agus', 'asep'] ['agus@example.com', 'asep@example.com']

## Create CSV_3

In [32]:
tx_date = []
tx_amount = []
tx_type = []

for i in dataset:
    for j in i['txs']:
        tx_date.append(j['tx_date'])
        tx_amount.append(j['tx_amount'])
        tx_type.append(j['tx_type'])
print(tx_date, tx_amount, tx_type)

table_3 = pd.DataFrame(list(zip(tx_id, tx_date, tx_amount, tx_type)), 
                       columns =['Id', 'tx_date', 'tx_amount', 'tx_type']).sort_values(by=['Id'])

table_3.to_csv('CSV_3.csv')

['2020-01-01', '2020-02-01', '2020-03-01', '2020-01-01', '2020-02-01', '2020-03-01'] [10, 10, 20, 10, 10, 20] ['buy', 'buy', 'sell', 'sell', 'sell', 'buy']